[
  {
    "img": "../assets/images/home-banner.webp",
    "imgAttribute": "Image by Canva",
    "imgDescription": "A Person Browsing the Internet",
    "id": "era-one",
    "href": "/timeline#era-one",
    "title": "Dot-com Boom",
    "period": "1995 - 2004",
    "description": "The Dot-com Boom era marked the beginning of the commercial internet age, characterized by rapid growth, speculation, and the establishment of foundational technologies that would support future digital innovations (Kroll et al., 2010). This period saw the transformation of the internet from an academic and military network into a global commercial platform that would revolutionize business, communication, and daily life. During this era, entrepreneurs and investors rushed to capitalize on the potential of the World Wide Web, leading to both spectacular successes and dramatic failures. The period was defined by the belief that traditional business models were obsolete and that internet-based companies could achieve rapid growth and profitability. While the dot-com bubble eventually burst in 2000, the technological infrastructure and digital literacy developed during this time laid the groundwork for all subsequent internet innovations.",
    "events": [
      {
        "img": "../assets/images/home-banner.webp",
        "imgAttribute": "Image by Canva",
        "imgDescription": "A Person Browsing the Internet",
        "title": "The World Goes Online",
        "period": "1995 - 2004",
        "description": "The Dot-com Boom era marked the beginning of the commercial internet age, characterized by rapid growth, speculation, and the establishment of foundational technologies that would support future digital innovations (Kroll et al., 2010). This period saw the transformation of the internet from an academic and military network into a global commercial platform that would revolutionize business, communication, and daily life. During this era, entrepreneurs and investors rushed to capitalize on the potential of the World Wide Web, leading to both spectacular successes and dramatic failures. The period was defined by the belief that traditional business models were obsolete and that internet-based companies could achieve rapid growth and profitability. While the dot-com bubble eventually burst in 2000, the technological infrastructure and digital literacy developed during this time laid the groundwork for all subsequent internet innovations.",
        "impact": "This era established several fundamental technologies and business models that continue to influence the digital landscape today. E-commerce platforms emerged, transforming retail and consumer behavior. Search engines evolved to help users navigate the rapidly expanding web. Online banking and digital payment systems began to challenge traditional financial institutions, something that created the foundation for the digital economy we know today. The era also witnessed the democratization of information and communication. Email became ubiquitous, websites proliferated across every industry, and the concept of “going online” became a normal part of daily life for millions of people worldwide (Hoffman & Novak, 1996). This period established the internet as an essential utility, setting the stage for the mobile and social media revolutions that would follow."
      },
      {
        "img": "../assets/images/facebook-launch.webp",
        "imgAttribute": "Image by Business Insider",
        "imgDescription": "Mark ZuckerBerg Showcasing Facebook During its Early Years",
        "title": "The Birth of Social Media (Facebook Launch)",
        "period": "2004",
        "description": "Facebook was started at Harvard University in 2004 by Mark Zuckerberg and his college roommates Eduardo Saverin, Andrew McCollum, Dustin Moskovitz, and Chris Hughes with the aim of connecting classmates on campus. The platform quickly grew in popularity on campus, and soon expanded to other Ivy league universities like Yale and Stanford, and eventually opened to the public allowing anyone above age 13 to sign up using a valid email address ('History of Facebook', 2025).",
        "impact": "The launch and exponential growth in popularity of Facebook truly ushered in the age of social media, paving the way for other internet products that aimed to connect people in one way or the other (through photos, videos, stories, etc). Since the platform encouraged connection through setting up of profiles where users entered personal data, concerns over privacy policy, especially Facebook’s collection and use of private data, began to surface, and these concerns are persistent even to this day."
      }
    ]
  },
  {
    "img": "../assets/images/social-media.jpg",
    "imgAttribute": "Image by dole777 on Unsplash",
    "imgDescription": "A Phone Showing Social Media Apps",
    "id": "era-two",
    "href": "/timeline#era-two",
    "title": "Social Media & Mobile",
    "period": "2005 - 2014",
    "description": "The Social Media & Mobile Revolution era fundamentally transformed how people connect, share information, and access digital services, as it marked the transition from static web pages to dynamic, user-generated content platforms and from desktop-bound internet access to ubiquitous mobile connectivity. This era was characterized by the democratization of content creation and the emergence of social networks as primary communication channels. The combination of improved mobile technology and social platforms created new forms of digital interaction that blurred the lines between online and offline experiences. The period established social media as a dominant force in communications, marketing, entertainment, and even political discourse.",
    "events": [
      {
        "img": "../assets/images/youtube-2005.png",
        "imgAttribute": "Image from Web Design Museum",
        "imgDescription": "YouTube User Interface During its Early Years",
        "title": "YouTube Launches",
        "period": "2005",
        "description": "Following the successful launch of Facebook, another social media platform, YouTube, was introduced in 2005, with an aim to revolutionize how people consume and create video content. For the first time, anyone with a camera and internet connection could broadcast to a global audience without traditional media gatekeepers.",
        "impact": "Unlike Facebook that made social interactions easier, allowing people to 'meet' and connect without physical interaction, YouTube effectively democritized video publishing. This democratization of video publishing, as Mostafa et al. (2023) explains, transformed entertainment, education, and communication. Apart from entertainment, YouTube created new career paths for content creators, changing how businesses approach marketing, and establishing video as the dominant form of online content."
      },
      {
        "img": "../assets/images/iphone-launch.webp",
        "imgAttribute": "Image from New York Post",
        "imgDescription": "Steve Job Launching the iPhone in 2007",
        "title": "iPhone Changes Mobile Internet Forever",
        "period": "2007",
        "description": "The introduction of the iPhone in 2007 represents one of the most significant technological breakthroughs of the modern era. By combining a phone, internet browser, media player, and application platform into a single, intuitive device, Apple redefined user expectations for mobile technology and accelerated the adoption of mobile internet services.",
        "impact": "The impact of the iPhone was immediately apparent in user behavior (Vitak, 2008). Mobile internet usage surged as people gained access to email (Wallace et al., 2012), web browsing, and applications from anywhere (Bastawrous et al., 2013). The device’s touchscreen interface and intuitive design made advanced computing accessible to users regardless of technical expertise, dramatically expanding the potential user base for digital services. The introduction of the App Store created an entirely new economic ecosystem, enabling developers worldwide to create and distribute mobile applications to millions of users. This marketplace model influenced how software is developed, distributed, and monetized across all computing platforms."
      },
      {
        "img": "../assets/images/bitcoin.webp",
        "imgAttribute": "Image from Shutterstock",
        "imgDescription": "Bitcoin Represented as the Next Gold",
        "title": "Bitcoin White Paper Released",
        "period": "2009",
        "description": "The release of Satoshi Nakamoto's Bitcoin white paper introduced the world to cryptocurrency and blockchain technology, proposing a peer-to-peer electronic cash system that operates without central authority (Nakamoto, 2008). This innovation challenged traditional financial systems and introduced new concepts of digital ownership and decentralized governance. Bitcoin's underlying blockchain technology proved to have applications far beyond cryptocurrency, introducing concepts of distributed ledgers, smart contracts, and decentralized networks that continue to influence technology development today.",
        "impact": "The success of cryptocurrency demonstrated the viability of decentralized digital systems and inspired thousands of subsequent blockchain projects. Nonetheless, there were also growing concerns about privacy, financial sovereignty, and the role of traditional institutions in the digital age. These themes would become increasingly important as digital platforms gained greater influence over economic and social activities."
      },
      {
        "img": "../assets/images/instagram.webp",
        "imgAttribute": "Image from TechCrunch",
        "imgDescription": "Instagram User Interface With Log In and Home Page",
        "title": "Instagram Launches",
        "period": "2010",
        "description": "The launch of Instagram in 2010 capitalized on the convergence of smartphone adoption, improved mobile cameras, and social networking trends. By focusing specifically on photo sharing with intuitive filters and editing tools, Instagram made high-quality visual content creation accessible to everyday users. The platform emphasizes visual storytelling, hence transforming how people share experiences and how businesses engage with customers. The rapid growth of Instagram clearly shows the changing patterns of social media usage, with users increasingly preferring visual platforms over text-based networks.",
        "impact": "Instagram's entry into the scene at the close of the decade cemented the foundation for today's connected world. The combination of ubiquitous mobile internet access and sophisticated social platforms created new forms of digital interaction that became integral to personal, professional, and commercial activities. However, just like with it's predecessors, the adoption of Instagram meant the creation of another avenue for the proliferation of challenges related to privacy, digital addiction, and the spread of misinformation. Moreover, the concentration of communication and commerce within a few major platforms started raising questions about digital monopolies and the need for regulation that continue to influence policy discussions today."
      }
    ]
  },
  {
    "img": "../assets/images/streaming.webp",
    "imgAttribute": "Image by Vipas Digital Marketing",
    "imgDescription": "Streaming Sites and A Person Using VR Headsets",
    "id": "era-three",
    "href": "/timeline#era-three",
    "title": "Streaming, AI, & 5G",
    "period": "2015 - Present",
    "description": "Streaming, AI, & 5G is characterized by the maturation of digital platforms and the emergence of artificial intelligence as a transformative force. This period has seen the convergence of high-speed connectivity, sophisticated algorithms, and massive datasets to create increasingly personalized and intelligent digital experiences. This era is distinguished by the shift from discrete digital tools to integrated ecosystems that anticipate user needs and adapt to individual preferences. The combination of streaming services, AI-powered recommendations, and ubiquitous connectivity has created a seamless digital environment that extends across devices and platforms.",
    "events": [
      {
        "img": "../assets/images/netflix-banner.jpg",
        "imgAttribute": "Image from Adobe Stock",
        "imgDescription": "Netflix Logo on a Black Screen",
        "title": "Netflix Streaming Dominates TV Habits",
        "period": "2015",
        "description": "By 2015, Netflix had successfully transitioned from a DVD rental service to the dominant force in streaming entertainment, fundamentally changing how people consume television and film content. The platform's success demonstrated the viability of on-demand, subscription-based content delivery and inspired numerous competitors to adopt similar models.",
        "impact": "The impact of this transformation extended beyond entertainment consumption to content creation. Netflix’s investment in original programming challenged traditional media companies, a good example of how technology companies could successfully compete in content production. The success of streaming also accelerated the decline of traditional cable television and established new patterns of media consumption. Binge-watching became a cultural phenomenon, and the concept of scheduled programming became increasingly obsolete for younger audiences."
      },
      {
        "img": "../assets/images/ar.webp",
        "imgAttribute": "Image from TechCrunch",
        "imgDescription": "A Person Using AR on Phone to Create Virtual Creature",
        "title": "Pokémon Go Shows Power of AR",
        "period": "2016",
        "description": "The launch of Pokémon Go in 2016 brought augmented reality technology to mainstream audiences for the first time.",
        "impact": "The unprecedented success of Pokémon Go proved that mobile technology could create new forms of entertainment and social interaction. Pokémon Go's impact was immediately visible in changed behavior patterns, as millions of players explored their neighborhoods and cities in search of virtual creatures."
      },
      {
        "img": "../assets/images/covid-19-effects.webp",
        "imgAttribute": "Image from Adobe Stock",
        "imgDescription": "A Person on an Online Meeting Working from Home",
        "title": "COVID-19 Accelerates Remote Work, Video Calls, and E-commerce",
        "period": "2020",
        "description": "The COVID-19 pandemic served as a massive accelerator for digital transformation, as it forced rapid adoption of remote work technologies, video conferencing platforms, and e-commerce services. Within months, behaviors and business practices that might have taken years to evolve became essential for maintaining operations during lockdowns.",
        "impact": "The impact of the pandemic on technology adoption was unprecedented in its speed and scope. Video conferencing platforms like Zoom experienced explosive growth as they became essential for everything from business meetings to social gatherings. E-commerce adoption accelerated as consumers shifted purchasing online, and digital payment systems became preferred methods for contactless transactions."
      },
      {
        "img": "../assets/images/ai-chatbot.png",
        "imgAttribute": "Illustration by Salesforce",
        "imgDescription": "A Chatbot at Work Illustration",
        "title": "AI Chatbots Enter Mainstream",
        "period": "2023 -",
        "description": "The launch of ChatGPT and similar AI chatbots in late 2022 and throughout 2023 kick-started mainstream artificial intelligence adoption. With these conversational AI systems, capabilities that seemed almost magical to many users, became reality, as they can generate human-like text for a wide variety of tasks and queries. Users quickly discovered applications ranging from creative writing assistance to code generation, but of course, with some limitations and biases in AI responses.",
        "impact": "The successful launch and usage of conversational AI systems triggered a new wave of investment and development in artificial intelligence across all technology companies, something akin to the Dot-com bubble in the late 1990s. The integration of AI capabilities into existing platforms and services became a competitive necessity, accelerating the development of AI-powered features across the technology landscape. However, it didn't take long before pertent questions about privacy, employment, and the concentration of power in technology companies started arising, moreso around mass layoffs in the name of replacing humans with more efficient AI systems and chatbots. And so as we look forward to what the future holds, one thing remains certain: the integration of AI into critical systems and decision-making processes requires careful consideration of bias, transparency, and accountability. As AI becomes more sophisticated and widespread, society must develop new frameworks for governing their development and deployment."
      }
    ]
  }
]
